import ProjectPage from './ProjectPage.jsx'

const data = {
    title: 'Christmas Card',
    liveUrl: 'https://card-christmas-pi.vercel.app/',
    desc: 'เว็บไซต์การ์ดอวยพรเทศกาลคริสต์มาสและปีใหม่ออนไลน์ เป็นแพลตฟอร์มเว็บแอปพลิเคชันที่ออกแบบมาเพื่อส่งมอบความสุขและความรู้สึกดี ๆ ในช่วงเทศกาลส่งท้ายปีเก่าต้อนรับปีใหม่ จุดเด่นของระบบคือความสามารถในการปรับเปลี่ยนรูปแบบการแสดงผล (Theme) ได้อย่างยืดหยุ่นตามความต้องการของผู้ใช้งาน โดยระบบถูกแบ่งออกเป็น 2 โหมดการทำงานหลัก ซึ่งมีการเลือกใช้จิตวิทยาคู่สี (Color Palette) และองค์ประกอบกราฟิกที่แตกต่างกัน เพื่อสร้างประสบการณ์ร่วมและความรู้สึกที่ตรงตามเอกลักษณ์ของแต่ละเทศกาลอย่างเด่นชัด',
    technologies: ['Html', 'CSS', 'Javascript'],
    features: [
        {
            title: 'ฟีเจอร์ที่ 1: Merry Christmas Mode (โหมดคริสต์มาส)',
            details: [
                'Snow-White Theme: ใช้โทนสีขาวสะอาดเป็นหลักเพื่อจำลองบรรยากาศของหิมะในฤดูหนาว ช่วยให้หน้าเว็บดูคลีน สะอาดตา และอ่านข้อมูลการ์ดอวยพรได้อย่างชัดเจน',
                'Christmas Elements Integration: มีการจัดวางองค์ประกอบภาพและกราฟิกดีไซน์ที่สะท้อนถึงวันคริสต์มาสโดยเฉพาะ (เช่น ต้นคริสต์มาส, กล่องของขวัญ, กวางเรนเดียร์ หรือตุ๊กตาหิมะ) เพื่อเพิ่มความมีชีวิตชีวาให้กับตัวการ์ด'
            ]
        },
        {
            title: 'ฟีเจอร์ที่ 2: Happy New Year Mode (โหมดสวัสดีปีใหม่)',
            details: [
                'Warm Brown Tone: เปลี่ยนมาใช้โทนสีน้ำตาลเข้มที่ให้ความรู้สึกอบอุ่น ทั่งยังช่วยสร้างมิติและความลึกให้กับหน้าเว็บเมื่อตัดกับสีขาวของตัวอักษร',
                'Premium Greeting Envelope Design: การออกแบบจัดวางอินเตอร์เฟซให้ความรู้สึกเสมือนกับการเปิดซองจดหมายการ์ดอวยพรปีใหม่แบบคลาสสิก มอบประสบการณ์ที่น่าประทับใจให้กับผู้รับ'
            ]
        }
    ],
    imgSrc: '/Images/Project/Christmas.png',
}

export default function ChristmasCardPage() {
    return <ProjectPage {...data} />
}
