import ProjectPage from './ProjectPage.jsx'

const data = {
    title: 'Clendear',
    liveUrl: 'https://calendar-kappa-rouge.vercel.app/login.html',
    desc: 'ระบบปฏิทินกิจกรรมออนไลน์ส่วนบุคคล เป็นเว็บแอปพลิเคชันสำหรับบริหารจัดการเวลาและวางแผนตารางงานที่ออกแบบมาเพื่อการใช้งานภายในเครือข่ายจำลองหรือเครื่องส่วนบุคคล (Localhost) โดยให้ความสำคัญกับความเป็นส่วนตัวและความเป็นเจ้าของข้อมูลของผู้ใช้งานแต่ละคนระบบทำงานโดยผูกตารางปฏิทินเข้ากับระบบเข้าสู่ระบบ (Login System) ตามชื่อบัญชีของผู้ใช้งาน (Username) ทำให้ผู้ใช้แต่ละคนสามารถเข้าถึงและจัดการหน้าปฏิทินส่วนตัวได้อย่างเป็นอิสระ ไม่ปะปนกัน ตัวแอปพลิเคชันรองรับการจัดการข้อมูลกิจกรรมอย่างครบวงจร (CRUD Operations) ทั้งการบันทึก การเลือกประเภทกิจกรรม การแก้ไข และการลบข้อมูล โดยเก็บรักษาข้อมูลทั้งหมดไว้ภายในสภาพแวดล้อมจำลองส่วนบุคคล ช่วยให้การวางแผนชีวิตประจำวันเป็นไปอย่างเป็นระบบ สะดวก และปลอดภัยจากภายนอก',
    technologies: ['Html', 'CSS', 'Javascript'],
    features: [
        {
            title: 'ฟีเจอร์ที่ 1: ระบบจัดการบัญชีผู้ใช้เฉพาะบุคคล (User Authentication & Isolated Views)เน้นการคัดแยกข้อมูลเพื่อความเป็นส่วนตัวในการเข้าใช้งานแอปพลิเคชัน',
            details: [
                'Username-Based Login: ระบบเข้าสู่ระบบอย่างง่ายด้วยชื่อผู้ใช้งาน โดยแอปพลิเคชันจะใช้ชื่อนี้เป็นคีย์หลักในการดึงข้อมูลตารางเวลาที่สัมพันธ์กับผู้ใช้คนนั้น ๆ มาแสดงผล',
                'Personalized Dashboard: หน้าจออินเตอร์เฟซปฏิทินจะปรับเปลี่ยนและแสดงผลเฉพาะกิจกรรมของบัญชีที่กำลังล็อกอินอยู่เท่านั้น ป้องกันไม่ให้ผู้ใช้อื่นเข้าถึงข้อมูลส่วนตัวได้'
            ]
        },
        {
            title: 'ฟีเจอร์ที่ 2: ระบบบริหารจัดการกิจกรรมบนปฏิทินครบวงจร (Interactive Calendar & Event Management)',
            details: [
                'Event Customization & Selection (Create & Read): ผู้ใช้สามารถกดเลือกวันบนปฏิทินเพื่อเพิ่มกิจกรรมใหม่ โดยมีตัวเลือกฟังก์ชันคำสั่งให้ระบุได้ว่า "ต้องการทำกิจกรรมประเภทใด', 
                'Event Modification & Deletion (Update & Delete): รองรับการเข้าไปแก้ไขข้อมูลรายละเอียดของกิจกรรมย้อนหลัง รวมถึงการกดลบกิจกรรมที่ไม่ต้องการออกจากตารางปฏิทินได้ทันทีแบบเรียลไทม์'
            ]
        }
    ],
    imgSrc: '/Images/Project/Calendar.png',
}

export default function ClendearPage() {
    return <ProjectPage {...data} />
}
