import ProjectPage from './ProjectPage.jsx'

const data = {
    title: 'Sensor Dashboard',
    liveUrl: 'https://dashboard-sensor-chi.vercel.app/index.html',
    desc: 'ระบบตรวจวัดข้อมูลคุณภาพสภาพอากาศแบบเรียลไทม์ (Sensor Dashboard) เป็นระบบโครงข่ายอินเทอร์เน็ตของสรรพสิ่ง (IoT) และการประมวลผลข้อมูลเชิงภาพ (Data Visualization) ที่พัฒนาขึ้นเพื่อเฝ้าระวัง ตรวจสอบ และวิเคราะห์สภาพแวดล้อมรวมถึงคุณภาพอากาศในพื้นที่เป้าหมายได้อย่างแม่นยำระบบจะทำงานร่วมกับฮาร์ดแวร์เซนเซอร์ (Sensors) หลายรูปแบบเพื่อดักจับและวัดค่าสารปนเปื้อนรวมถึงดัชนีชี้วัดสภาพอากาศต่าง ๆ ได้แก่ อุณหภูมิ, ความชื้น, ความดันอากาศ, ก๊าซคาร์บอนไดออกไซด์, ก๊าซมีเทน, และไอระเหยของเอทานอล จากนั้นข้อมูลทั้งหมดจะถูกส่งผ่านระบบเครือข่ายไร้สายเพื่อนำมาประมวลผลและแสดงผลบนเว็บแอปพลิเคชันในรูปแบบของ แดชบอร์ด (Dashboard) ช่วยให้ผู้ใช้งานสามารถติดตามสถานะปัจจุบัน รวมถึงวิเคราะห์แนวโน้มการเปลี่ยนแปลงของสภาพอากาศได้อย่างต่อเนื่อง ทันต่อเหตุการณ์ และสามารถเตรียมการรับมือกับสถานการณ์ความผิดปกติได้อย่างทันท่วงที',
    technologies: ['Html', 'CSS', 'Javascript', 'C'],
    features: [
        {
            title: 'ฟีเจอร์ที่ 1: ระบบตรวจวัดและส่งข้อมูลแบบเรียลไทม์ (Real-time Telemetry & Sensor Integration)',
            details: [
                'Multi-Sensor Data Acquisition: รองรับการเชื่อมต่อและอ่านค่าจากเซนเซอร์วัดสภาพอากาศและก๊าซหลากหลายชนิดพร้อมกันอย่างเสถียร',
                'High-Frequency Wireless Data Transmission: ระบบไมโครคอนโทรลเลอร์ทำการอัปเดตและส่งข้อมูลดิบจากเซนเซอร์เข้าสู่ฐานข้อมูลและหน้าจอแสดงผลอย่างต่อเนื่องแบบ Real-time'
            ]
        },
        {
            title: 'ฟีเจอร์ที่ 2: แดชบอร์ดแสดงผลอัจฉริยะ (Intelligent Data Visualization Dashboard)',
            details: [
                'Live Telemetry Widgets & Trend Graphs: แสดงผลค่าปัจจุบันของสภาพอากาศในรูปแบบเกจวัด (Gauges) หรือตัวเลขที่เด่นชัด พร้อมทั้งมีกราฟเส้น (Line Charts) แสดงประวัติย้อนหลังเพื่อดูแนวโน้มการเปลี่ยนแปลง (Historical Trends)',
                'Smart Color-Coded Alert System (ระบบเตือนภัยด้วยสี): ตัวกราฟและวิดเจ็ตแสดงผลมีความสามารถในการเปลี่ยนสีตามระดับความอันตรายของค่าที่วัดได้ (เช่น สีเขียว = ปลอดภัย, สีเหลือง = ควรเฝ้าระวัง, สีแดง = อันตราย) ช่วยให้ผู้สังเกตการณ์รับรู้ถึงสภาวะผิดปกติได้ทันทีโดยไม่ต้องเสียเวลาอ่านค่าตัวเลขโดยละเอียด'
            ]
        }
    ],
    imgSrc: '/Images/Project/Sensor_Dashboard.png',
}

export default function SensorDashboardPage() {
    return <ProjectPage {...data} />
}