import ProjectPage from './ProjectPage.jsx'

const data = {
    title: 'PortFolio Terrain',
    liveUrl: 'https://portfolio-alongkorn.netlify.app/',
    desc: 'พอร์ตโฟลิโอโลก 3 มิติเชิงปฏิสัมพันธ์ เป็นการพลิกโฉมการนำเสนอผลงาน (Portfolio) รูปแบบเดิม ๆ ให้กลายเป็นการเดินทางสำรวจในโลกเสมือนจริง โดยตัวระบบถูกพัฒนาขึ้นในรูปแบบงานกราฟิกสไตล์ Low-Poly (Vertex-based Architecture) ที่เน้นความสวยงามร่วมสมัย คลาสสิก และใช้ทรัพยากรระบบได้อย่างมีประสิทธิภาพพื้นที่ภายในเกมหรือโลกจำลองนี้จะถูกแบ่งออกเป็น 5 เมืองหลัก (5 Unique Realms) ซึ่งแต่ละเมืองจะทำหน้าที่เป็นตัวแทนของแต่ละโปรเจกต์ที่เคยพัฒนาขึ้นในอดีต (เช่น เมืองแขนกล, เมืองระบบตรวจวัดอากาศ, เมืองปฏิทินออนไลน์ เป็นต้น) ผู้ใช้งานสามารถสวมบทบาทเป็นนักสำรวจเพื่อเดินทางข้ามมิติผ่านประตูพอร์ตอล (Portal Teleportation) และเพลิดเพลินไปกับสภาพแวดล้อมที่มีชีวิตชีวาจากการจำลองฟิสิกส์และการเคลื่อนไหวแบบเรียลไทม์ ทำให้การอ่านพอร์ตโฟลิโอเปลี่ยนเป็นประสบการณ์การเล่นเกม (Gamified Experience) ที่น่าตื่นตาตื่นใจและน่าจดจำ',
    technologies: ['Three.js', 'React', 'WebGL', 'CSS', 'HTML', 'Blender'],
    features: [
        {
            title: 'ฟีเจอร์ที่ 1: สถาปัตยกรรม 5 เมืองแห่งผลงาน (The 5 Project Realms)',
            details: [
                'Thematic World Partitioning: โลกจำลองถูกแบ่งออกเป็น 5 เขตเมืองอย่างชัดเจน โดยแต่ละเมืองจะถูกออกแบบธีม คอนเซปต์ และบรรยากาศให้สอดคล้องกับเนื้อหาของโปรเจกต์นั้น ๆ โดยเฉพาะ',
                'Interactive Project Showcase: เมื่อผู้ใช้เดินทางไปถึงใจกลางของแต่ละเมือง จะสามารถปฏิสัมพันธ์กับจุดบริการข้อมูล เพื่อเปิดดูรายละเอียด คำอธิบาย เทคโนโลยีที่ใช้ หรือลิงก์ไปยังซอร์สโค้ดของโปรเจกต์นั้นได้โดยตรง'
            ]
        },
        {
            title: 'ฟีเจอร์ที่ 2: การจำลองสภาพแวดล้อมแบบมีชีวิต (Living World Animation & VFX)',
            details: [
                'Foliage Dynamic Shaders: ระบบจำลองการเคลื่อนไหวของพืชพรรณธรรมชาติ เช่น ใบไม้ไหว พุ่มหญ้าเอนเอียงตามแรงลมอย่างเป็นธรรมชาติผ่านเทคนิค Shader Programming (Vertex Manipulation)',
                'VFX Portal Teleportation: ระบบเคลื่อนย้ายมวลสาร (Warp) ระหว่างเมืองด้วย "ประตูพอร์ตอล" ที่มาพร้อมกับเอฟเฟกต์แสง สี และอนุภาค (Particle Effects) ที่หมุนวนอย่างสวยงามเมื่อผู้ใช้งานเปิดใช้งาน',
                'Hidden Easter Eggs & Exploration: มีกลไกการเคลื่อนไหวและลูกเล่นเล็ก ๆ น้อย ๆ ซ่อนอยู่ตามจุดต่างๆ ในแอนิเมชันของฉาก (เช่น วัตถุที่ขยับได้เมื่อเมาส์ไปโดน) เพื่อกระตุ้นให้ผู้ใช้งานเกิดความรู้สึกอยากสำรวจและค้นหา'
            ]
        }
    ],
    imgSrc: '/Images/Project/Portfolio.png',
}

export default function ArmRoboticPage() {
    return <ProjectPage {...data} />
}
